hws/rails-introo/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings_list
    @selected_ratings = params['ratings'] != nil ? params['ratings'] : Hash.new
    @selected_ratings = (session[:settings].nil? ? @all_ratings: session[:settings][0]) if @selected_ratings.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY title